tutorials/axialFlowTurbineAL/system/elementData
// Blade element data
// axialDistance, radius, azimuth, chord, chordMount, twist
(0.0    0.00075      0.0     0.0135      0.25    0.0)
(0.0    0.0049       0.0     0.0135      0.25    0.0)
(0.0    0.0054999    0.0     0.0495      0.25    -38.0)
(0.0    0.005    -3.0     0.0495      0.25    -38.0)
(0.0    0.0055001    -2.0     0.0495      0.25    -38.0)




