tutorials/axialFlowTurbineAL/system/elementDataKa4-70
// Blade element data
// axialDistance, radius, azimuth, chord, chordMount, twist
(0.0    0.00075      0.0     0.0135      0.25    0.0)
(0.0    0.0049       0.0     0.0135      0.25    0.0)
(0.0    0.0054999    0.0     0.0495      0.25    -38.0)
(0.0    0.00675      0.0     0.081432    0.25    -37.055)
(0.0    0.00824985   0.0     0.08011     0.25    -32.544)
(0.0    0.00975015   0.0     0.077013    0.25    -28.677)
(0.0    0.01125      0.0     0.073125    0.25    -25.262)
(0.0    0.01274985   0.0     0.0690075   0.25    -22.43)
(0.0    0.01425015   0.0     0.064953    0.25    -19.988)
(0.0    0.01575      0.0     0.061101    0.25    -18.034)
(0.0    0.01724985   0.0     0.057519    0.25    -16.349)
(0.0    0.01875015   0.0     0.054225    0.25    -14.663)
(0.0    0.02025      0.0     0.0512055   0.25    -13.067)
(0.0    0.02174985   0.0     0.048447    0.25    -11.829)
(0.0    0.02325015   0.0     0.0459315   0.25    -10.753)
(0.0    0.02475      0.0     0.043632    0.25    -9.8177)
(0.0    0.02624985   0.0     0.0415287   0.25    -8.8827)
(0.0    0.02775015   0.0     0.0396009   0.25    -7.9877)
(0.0    0.02925      0.0     0.0378306   0.25    -7.2527)
(0.0    0.03074985   0.0     0.0362007   0.25    -6.565)
(0.0    0.03225015   0.0     0.0346968   0.25    -5.9187)
(0.0    0.03375      0.0     0.0333063   0.25    -5.3045)
(0.0    0.03524985   0.0     0.0320171   0.25    -4.7185)
(0.0    0.03675015   0.0     0.03081915  0.25    -4.1316)
(0.0    0.03825      0.0     0.02970405  0.25    -3.5439)
(0.0    0.03974985   0.0     0.02866365  0.25    -2.9433)
(0.0    0.04125015   0.0     0.0276912   0.25    -2.2185)
(0.0    0.04275      0.0     0.0267804   0.25    -1.097)
(0.0    0.04424985   0.0     0.02592585  0.25    0.71674)
